List<String> hadith = [
  'عنْ أَبِى هُرَيْرَةَ قَالَ : قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم : ( مَنْ أَقَالَ مُسْلِماً أَقَالَهُ اللَّهُ عَثْرَتَهُ يَوْمَ الْقِيَامَةِ )',
  'وكان صلى الله عليه وسلم يساوم في الشراء ، ولا يبخس الناس بضاعتهم ، كما مر معنا في حديث جمل جابر',
  '( رأى ) رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يَزِنُ بِالأَجْرِ ، فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم : ( زِنْ وَأَرْجِحْ )',
  'عن أبي اليسر رضي الله عنه قال : قال صلى الله عليه وسلم : ( مَنْ أَنْظَرَ مُعْسِراً أَوْ وَضَعَ عَنْهُ أَظَلَّهُ اللَّهُ فِي ظِلِّهِ )',
  'كان صلى الله عليه وسلم ينهى عن التعامل بالربا ، وبيع الغرر ، وبيع العِينة ، والتجارة بالمحرمات , وعن الغش والخداع',
  'أَنَّ النَّبِيَّ ﷺ سُئِلَ: أَيُّ الْكَسْبِ أَطْيَبُ؟ قَالَ: عَمَلُ الرَّجُلِ بِيَدِهِ، وَكُلُّ بَيْعٍ مَبْرُورٍ.',
  'سَمِعْتُ رَسُولَ اللَّهِ ﷺ يَقُولُ: إِذَا اخْتَلَفَ الْمُتَبَايِعَانِ لَيْسَ بَيْنَهُمَا بَيِّنَةٌ، فَالْقَوْلُ مَا يَقُولُ رَبُّ السِّلْعَةِ أَوْ يَتَتَارَكَانِ',
  'وَعَنْ مَيْمُونَةَ زَوْجِ النَّبِيِّ ﷺ وَرَضِيَ عَنْهَا: أَنَّ فَأْرَةً وَقَعَتْ فِي سَمْنٍ، فَمَاتَتْ فِيهِ، فَسُئِلَ النَّبِيُّ ﷺ عَنْهَا، فَقَالَ: أَلْقُوهَا وَمَا حَوْلَهَا، وَكُلُوهُ',
  'عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ قَالَ: قَالَ رَسُولُ اللَّهِ ﷺ: لَا يَحِلُّ سَلَفٌ وَبَيْعٌ، وَلَا شَرْطَانِ فِي بَيْعٍ، وَلَا رِبْحُ مَا لَمْ يُضْمَنْ، وَلَا بَيْعُ مَا لَيْسَ عِنْدَكَ. رَوَاهُ الْخَمْسَةُ،',
  'نَهَى رَسُولُ اللَّهِ ﷺ عَنْ بَيْعِ الْعُرْبَانِ. رَوَاهُ مَالِكٌ',
  'من باع عيبا لم يبيّنه، لم يزل في مقت الله ولم تزل الملائكة تلعنه.'
];
